#ifndef __plain__
#define __plain__

#include <fstream>

#include "rnd.h"

struct plain {
    int speed, distance;
    int fly_distance, lifting_capacity;
};


//------------------------------------------------------------------------------
// ввод самолёта из потока ввода
void In(plain &p, std::ifstream &ifst);


//------------------------------------------------------------------------------
// инициализация случайного самолёта
void InRnd(plain &p);


//------------------------------------------------------------------------------
// вывод самолета в поток вывода
void Out(plain &p, std::ofstream &ofst);


//------------------------------------------------------------------------------
// вычисление оптимального времени, для самолёта
double OptimalTime(plain &p);

#endif //__plain__
