#ifndef __train__
#define __train__

#include <fstream>

#include "rnd.h"

struct train {
    int speed, distance;
    int cars_counter;
};


//------------------------------------------------------------------------------
// ввод поезда из потока ввода
void In(train &t, FILE* file);


//------------------------------------------------------------------------------
// инициализация случайного поезда
void InRnd(train &t);

//------------------------------------------------------------------------------
// вывод поезда в поток вывода
void Out(train &t, FILE* file);

//------------------------------------------------------------------------------
// вычисление оптимального времени, для поезда
double OptimalTime(train &t);

#endif //__train__